Revit 2027 API
MEPFamilyConnectorInfo Properties
The MEPFamilyConnectorInfo type exposes the following members.
Properties
Name | Description
IsPrimary |  True if this is the primary connector.
(Inherited from MEPConnectorInfo)
IsSecondary |  True if this is the secondary connector.
(Inherited from MEPConnectorInfo)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from MEPConnectorInfo)
LinkedConnector |  The linked connector or null if there is no linked connector
(Inherited from MEPConnectorInfo)
Top
See Also
Reference
MEPFamilyConnectorInfo Class
Autodesk.Revit.DB Namespace